public_html/other/main.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#unnumbered-1">About me</a></li>
<li><a href="#unnumbered-2">Автоматический поиск работы</a></li>
<li><a href="#unnumbered-3">Система автоматизации тестирования</a></li>
<li><a href="#unnumbered-4">Моделирование электронных схем</a></li>
<li><a href="#unnumbered-5">Умный гараж с нуля</a></li>
<li><a href="#unnumbered-6">Структура и интерпретация компьютерных программ (SICP)</a></li>
<li><a href="#unnumbered-7">Типы в языках программирования (TAPL)</a></li>
<li><a href="#unnumbered-8">Литературное программирование</a></li>
<li><a href="#unnumbered-9">Макросы в Lisp</a></li>
<li><a href="#unnumbered-10">Как проектируются IP-блоки и системы на кристалле</a></li>
</ul>
</div>
</div>
<heading id="outline-container-unnumbered-1" class="outline-2">
<h2 id="unnumbered-1">About me</h2>
<div class="outline-text-2" id="text-unnumbered-1">
<p>
Меня зовут <code>Михаил Rigidus Глухов</code>, я программист и системный
архитектор. На этом сайте я собираю материалы по интересующим меня
темам.
</p>

<p>
Мне интересна теория языков программирования, алгоритмика,
робототехника и все что связано с интернетом вещей.
</p>
</div>
</heading>

<heading id="outline-container-unnumbered-2" class="outline-2">
<h2 id="unnumbered-2">Автоматический поиск работы</h2>
<div class="outline-text-2" id="text-unnumbered-2">
<p>
Все программисты ищут (или искали) работу на профильных сайтах и
каждый из них хоть раз задумывался об автоматизации рутинных
операций.
</p>

<p>
Я решил пойти дальше и разработал экспертную систему с элементами
искусственного интеллекта, которая ищет работу за меня в полностью
автоматическом режиме - от подбора вакансий до автоматической
адаптации резюме.
</p>
</div>
</heading>

<heading id="outline-container-unnumbered-3" class="outline-2">
<h2 id="unnumbered-3">Система автоматизации тестирования</h2>
<div class="outline-text-2" id="text-unnumbered-3">
<p>
Однажды мне захотелось тестировать не только web но и gui-приложения
и я решил написать маленький скрипт, способный действовать от имени
пользователя, как если бы он сам манипулировал мышью и клавиатурой,
считывая картинку на экране.
</p>
</div>
</heading>

<heading id="outline-container-unnumbered-4" class="outline-2">
<h2 id="unnumbered-4">Моделирование электронных схем</h2>
<div class="outline-text-2" id="text-unnumbered-4">
<p>
Распространение сигнала внутри схемы дает возможность иначе
взглянуть на процесс программирования и отладки и применить очень
необычные и мощные идеи.
</p>

<p>
Я написал язык предметной области (DSL) для построения схем и
виртуальную машину в которой он исполняется, чтобы получать
результаты распространения сигнала в моделируемой схеме.
</p>

<p>
Однако этого оказалось недостаточно для обеспечения наглядности,
поэтому я изучил Tcl/Tk и запрограммировал визуализатор
распространения сигнала, чтобы прямо на экране видеть, как высокие и
низкие уровни двигаются от одного элемента к другому.
</p>
</div>
</heading>

<heading id="outline-container-unnumbered-5" class="outline-2">
<h2 id="unnumbered-5">Умный гараж с нуля</h2>
<div class="outline-text-2" id="text-unnumbered-5">
<p>
Не первый опыт в автоматике и робототехнике, но пожалуй первый
настолько масштабный проект.
</p>

<p>
Ядром системы является платформа BeagleBoneBlack, остальная часть
большей частью самодельная, с помощью ЛУТ и гремучей смеси
современных микроконтроллеров и старых советских комплектующих,
найденных непонятно где.
</p>

<p>
Содержит систему автономного питания, вентиляции, освещения
электронный замок и видеоконтроль периметра с элементами машинного
зрения. Планируется добавить систему сопротивления вторжению в виде
пейнтбольного маркера с наведением на движуюся цель.
</p>
</div>
</heading>

<heading id="outline-container-unnumbered-6" class="outline-2">
<h2 id="unnumbered-6">Структура и интерпретация компьютерных программ (SICP)</h2>
<div class="outline-text-2" id="text-unnumbered-6">
<p>
Материал этой книги был основой вводного курса по информатике в MIT
начиная с 1980 года. К тому времени, как было выпущено первое
издание, этот материал преподавался в течение четырех лет, и прошло
еще двенадцать лет до появления второго издания.
</p>

<p>
<a href="http://rigidus.ru/resources/sicp.pdf%22">Структура и интерпретация компьютерных программ. Абельсон, Сассман (перевод: Ю. Бронников)</a>
</p>
</div>
</heading>

<heading id="outline-container-unnumbered-7" class="outline-2">
<h2 id="unnumbered-7">Типы в языках программирования (TAPL)</h2>
<div class="outline-text-2" id="text-unnumbered-7">
<p>
Книга о теории типов. Рассматриваются вопросы проверки и
автоматического вывода типов в языках программирования со
статической типизацией. Для каждой темы сначала дается теория, а
затем приводится реализация на OCaml.
</p>

<p>
TAPL — это, бесспорно, настоящий кладезь знаний для разработчиков
языков программирования со статической типизацией.
</p>

<p>
<a href="http://rigidus.ru/resources/tapl.pdf%22">Типы в языках программирования. Бенджамин Пирс</a>
</p>
</div>
</heading>

<heading id="outline-container-unnumbered-8" class="outline-2">
<h2 id="unnumbered-8">Литературное программирование</h2>
<div class="outline-text-2" id="text-unnumbered-8">
<p>
Слайды с лекции "Грамотное программирование" (literate programming),
которую я читал 22 января 2015 доступны
<a href="http://slides.com/rigidusrigidus/deck#/%22"><a href="http://slides.com/rigidusrigidus/deck/">http://slides.com/rigidusrigidus/deck/</a></a>
</p>
</div>
</heading>

<heading id="outline-container-unnumbered-9" class="outline-2">
<h2 id="unnumbered-9">Макросы в Lisp</h2>
<div class="outline-text-2" id="text-unnumbered-9">
<p>
Видео, с доклада на ноябрьском FProg Meetup "Макросы в лиспе"
опубликовано на youtube: <a href="https://www.youtube.com/watch?v=i1lD2J7qLLM%22"><a href="https://www.youtube.com/watch?v=i1lD2J7qLLM">https://www.youtube.com/watch?v=i1lD2J7qLLM</a></a>
</p>
</div>
</heading>

<heading id="outline-container-unnumbered-10" class="outline-2">
<h2 id="unnumbered-10">Как проектируются IP-блоки и системы на кристалле</h2>
<div class="outline-text-2" id="text-unnumbered-10">
<p>
Юрий Панчул прочитал эту лекцию в Алма-Ате и я подготовил небольшой
конспект. Осталось немного довести его до ума и я выложу его на
сайт, а пока доступно <a href="https://www.youtube.com/watch?v=sPaMiEunT_M%22">видео</a>, <a href="http://www.silicon-russia.com/public_materials/2016_09_01_kazakhstan/day_1_industry/03_slides/03_extra_eda_flow_2015_10_25.pdf%22">слайды</a> и его <a href="https://habrahabr.ru/post/309570/%22">отчетный пост</a> на хабре.
</p>
</div>
</heading>
